st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/MB1303_DRP_DUAL_PORT_RTOS/Src/usbpd_dpm.c
    /* Terminate PE task */
    if (DPM_Ports[PortNum].PE_TaskHandle != NULL)
    {
      osThreadTerminate(DPM_Ports[PortNum].PE_TaskHandle);
      DPM_Ports[PortNum].PE_TaskHandle = NULL;
    }
    
    /* perform a reset of all layer in any case */
    USBPD_PE_Reset(PortNum);
      
    /* Assert STUSB1602 software RESET */
    //HW_IF_RESET_CTRL(PortNum);
    
    /* Set the disconnection status */
    DPM_Ports[PortNum].DPM_IsConnected = 0;
    
#ifdef USBPD_CLI
    if (State == USBPD_CAD_STATE_DETACHED)
    {
      sprintf(cli_text, "\r\n*** [%d] detached\r\n", PortNum);
      CLI_Async_Notify(cli_text);
    }
#endif /* USBPD_CLI */
    
#ifdef USBPD_LED_SERVER
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_OFF, 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);
    
    /* Check port role to initialize Role LED*/
    Led_Set(DPM_Leds[PortNum].Role, LED_MODE_FromPowerRole(DPM_Ports[PortNum].DPM_PortPowerRole), 0);
#endif /* USBPD_LED_SERVER */
    break;
    
  case USBPD_CAD_STATE_ACCESSORY:
#ifdef USBPD_CLI
    sprintf(cli_text, "\r\n*** [%d] attached: audio accessory not supported\r\n", PortNum);
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */    
    break;
    
  case USBPD_CAD_STATE_DEBUG:
#ifdef USBPD_CLI
    sprintf(cli_text, "\r\n*** [%d] attached: debug not supported\r\n", PortNum);
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */    
    break;
  default:
#ifdef USBPD_CLI
    sprintf(cli_text, "\r\n*** [%d] unknown status\r\n", PortNum);
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */    
    break;
  }
}

/**
  * @brief  Callback function called by PE layer when HardReset message received from PRL
  * @param  PortNum The current port number
  * @param  CurrentRole the current role
  * @param  Status status on hard reset event
  * @retval 0 if continue 1 otherwise
  */
static uint32_t USBPD_DPM_HardReset(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_HR_Status_TypeDef Status)
{
  HAL_StatusTypeDef res = HAL_ERROR;
  switch(Status)
  {
  case USBPD_HR_STATUS_START_ACK:
    res = USBPD_HW_IF_HR_Start(PortNum, CurrentRole, ACKNOWLEDGE);
    USBPD_DPM_TurnOffPower(PortNum, CurrentRole);
    break;
  case USBPD_HR_STATUS_START_REQ:
    res = USBPD_HW_IF_HR_Start(PortNum, CurrentRole, REQUEST);
    USBPD_DPM_TurnOffPower(PortNum, CurrentRole);
    break;
  case USBPD_HR_STATUS_WAIT_VBUS_VSAFE0V:
    res = USBPD_HW_IF_HR_CheckVbusVSafe0V(PortNum, CurrentRole);
#ifndef STUSB1602_CUT_1_3
    if (res == HAL_OK && CurrentRole == USBPD_PORTPOWERROLE_SNK)
    {
    /* Workaround: To emulate VBus0Safe condition starting from VBus_Presence condition */ 
      osDelay(300);
    }
#endif
    break;
  case USBPD_HR_STATUS_COMPLETED:
    res = USBPD_HW_IF_HR_End(PortNum, CurrentRole);
    USBPD_DPM_TurnOnPower(PortNum, CurrentRole);
    break;
  case USBPD_HR_STATUS_FAILED:
    res = USBPD_HW_IF_HR_End(PortNum, CurrentRole);
    break;
  default:
      break;
  }
  
  return res;
}

/**
  * @brief  Request the DPM to setup the new power level.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_SetupNewPower(uint8_t PortNum)
{
  uint8_t rdoposition;

  /* Retrieve Request DO position from DPM handle : RDO position in the table of PDO (possible value from 1 to 7) */
  rdoposition = DPM_Ports[PortNum].DPM_RDOPosition;

  /* Check if get the right pdo position */
  if (rdoposition > 0)
  {
    USBPD_PWR_IF_SetProfile(PortNum, rdoposition-1);
  }
  else
  {
    /* Put it to VSafe5V */
    USBPD_PWR_IF_SetProfile(PortNum, 0);
  }
}

/**
  * @brief  Turn Off power supply.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_TurnOffPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  USBPD_PWR_IF_Enable(PortNum, DISABLE, Role);

#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  Turn On power supply.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_TurnOnPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  /* Enable the output */
  USBPD_PWR_IF_Enable(PortNum, ENABLE, Role);

#ifdef USBPD_LED_SERVER
  /* Led feedback */
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
#endif /* USBPD_LED_SERVER */
}

#ifdef USBPD_DPM_PRS
/**
  * @brief  Assert Rp resistor.
  * @param  PortNum The current port number
  * @retval None
*/
static void USBPD_DPM_AssertRp(uint8_t PortNum)
{
  //USBPD_CAD_AssertRp(PortNum);
  
#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].Role, LED_MODE_BLINK_ROLE_SRC, 0);
#endif /* USBPD_LED_SERVER */
  
  /* Set the new power role */
  DPM_Ports[PortNum].DPM_PortPowerRole = USBPD_PORTPOWERROLE_DRP_SRC;
}

/**
  * @brief  Assert Rd resistor.
  * @param  PortNum: The current port number
  * @retval None
*/
static void USBPD_DPM_AssertRd(uint8_t PortNum)
{
  //USBPD_CAD_AssertRd(PortNum);

#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].Role, LED_MODE_BLINK_ROLE_SNK, 0);
#endif /* USBPD_LED_SERVER */
  
  /* Set the new power role */
  DPM_Ports[PortNum].DPM_PortPowerRole = USBPD_PORTPOWERROLE_DRP_SNK;
}

/**
  * @brief  Request the PE to perform a Power Role Swap.
  * @param  PortNum: The current port number
  * @retval None
*/
void USBPD_DPM_RequestPowerRoleSwap(uint8_t PortNum)
{
  USBPD_PE_RequestPowerRoleSwap(PortNum);
}

/**
  * @brief  Evaluate the swap request from PE.
  * @param  PortNum: The current port number
  * @retval USBPD_OK if PR_swap is possible, else USBPD_ERROR
*/
static USBPD_StatusTypeDef USBPD_DPM_EvaluatPRSwap(uint8_t PortNum)
{
  return USBPD_OK;
}

/**
  * @brief  Power role swap status update
  * @param  PortNum Port number
  * @param  CurrentRole the current role
  * @param  Status status on power role swap event
  */
static void USBPD_DPM_PowerRoleSwap(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_PRS_Status_TypeDef Status)
{
  if (CurrentRole == USBPD_PORTPOWERROLE_SRC || CurrentRole == USBPD_PORTPOWERROLE_SNK)
  {
    switch (Status)
    {
    case USBPD_PRS_STATUS_START_ACK:
#ifdef USBPD_LED_SERVER
      /* Led feedback */
//      Led_Set(DPM_Leds[PortNum].Role, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */ 
      USBPD_HW_IF_PRS_Start(PortNum, CurrentRole, ACKNOWLEDGE);
      break;
    case USBPD_PRS_STATUS_START_REQ:
#ifdef USBPD_LED_SERVER
      /* Led feedback */
//      Led_Set(DPM_Leds[PortNum].Role, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */       
      USBPD_HW_IF_PRS_Start(PortNum, CurrentRole, REQUEST);
      break;
    case USBPD_PRS_STATUS_ACCEPTED:
      STUSB16xx_HW_IF_Set_VBus_Monitoring(PortNum, DPM_Ports[PortNum].DPM_RequestedVoltage, 10, 10);
#ifdef USBPD_LED_SERVER
      /* Led feedback */
//      Led_Set(DPM_Leds[PortNum].Role, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */ 

