st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/MB1303_DRP_DUAL_PORT_RTOS/Src/usbpd_dpm.c
#ifdef USBPD_CLI
      sprintf(cli_text,  "\r\n*** [%c] PRS accepted\r\n", (PortNum + '0'));
      CLI_Async_Notify(cli_text);
#endif
      break;
    case USBPD_PRS_STATUS_REJECTED:
      USBPD_HW_IF_PRS_End(PortNum, CurrentRole);
      STUSB16xx_HW_IF_Set_VBus_Monitoring(PortNum, DPM_Ports[PortNum].DPM_RequestedVoltage, 10, 10);
#ifdef USBPD_CLI
      sprintf(cli_text,  "\r\n*** [%c] PRS reject\r\n", (PortNum + '0'));
      CLI_Async_Notify(cli_text);
#endif
      break;
    case USBPD_PRS_STATUS_WAIT:
      USBPD_HW_IF_PRS_End(PortNum, CurrentRole);
      STUSB16xx_HW_IF_Set_VBus_Monitoring(PortNum, DPM_Ports[PortNum].DPM_RequestedVoltage, 10, 10);
#ifdef USBPD_CLI
      sprintf(cli_text,  "\r\n*** [%c] PRS wait\r\n", (PortNum + '0'));
      CLI_Async_Notify(cli_text);
#endif
      break;
    case USBPD_PRS_STATUS_VBUS_OFF:
      USBPD_HW_IF_PRS_Vbus_OFF(PortNum, CurrentRole);
      USBPD_DPM_TurnOffPower(PortNum, CurrentRole);
//      osDelay(2);
      break;
    case USBPD_PRS_STATUS_SRC_RP2RD:
      USBPD_HW_IF_PRS_Assert_Rd(PortNum, CurrentRole);
      osDelay(20); 		/* Rd must be asserted before sending PS_RDY */
      break;
    case USBPD_PRS_STATUS_SRC_PS_READY_SENT:
      break;
    case USBPD_PRS_STATUS_SNK_PS_READY_RECEIVED:
#ifdef USBPD_CLI
      sprintf(cli_text,  "\r\n*** [%c] PS Ready received\r\n", (PortNum + '0'));
      CLI_Async_Notify(cli_text);
#endif
      break;
    case USBPD_PRS_STATUS_SNK_RD2RP:
      USBPD_HW_IF_PRS_Assert_Rp(PortNum, CurrentRole);
      break;
    case USBPD_PRS_STATUS_VBUS_ON:
      USBPD_DPM_TurnOnPower(PortNum, CurrentRole);
      break;
    case USBPD_PRS_STATUS_SNK_PS_READY_SENT:
      break;
    case USBPD_PRS_STATUS_SRC_PS_READY_RECEIVED:
      break;
    case USBPD_PRS_STATUS_COMPLETED:
      USBPD_HW_IF_PRS_End(PortNum, CurrentRole);
      STUSB16xx_HW_IF_Set_VBus_Monitoring(PortNum, DPM_Ports[PortNum].DPM_RequestedVoltage, 10, 10);
#ifdef USBPD_LED_SERVER
      /* Led feedback */
      Led_Set(DPM_Leds[PortNum].Role, (CurrentRole == USBPD_PORTPOWERROLE_SRC ? LED_MODE_BLINK_ROLE_SRC : LED_MODE_BLINK_ROLE_SNK), 0);
#endif /* USBPD_LED_SERVER */
#ifdef USBPD_CLI
      sprintf(cli_text,  "\r\n*** [%c] PRS new role: ", (PortNum + '0'));
      strcat(cli_text, CurrentRole == USBPD_PORTPOWERROLE_SRC ? "Source" : "Sink"); /* Parameter received by the event */
      strcat(cli_text, "\r\n");
      CLI_Async_Notify(cli_text);
#endif
      break;
    case USBPD_PRS_STATUS_FAILED:
    case USBPD_PRS_STATUS_ABORTED:    
#ifdef USBPD_LED_SERVER
      /* Led feedback */
      Led_Set(DPM_Leds[PortNum].Role, (CurrentRole == USBPD_PORTPOWERROLE_SRC ? LED_MODE_BLINK_ROLE_SRC : LED_MODE_BLINK_ROLE_SNK), 0);
#endif /* USBPD_LED_SERVER */      
      break;
    default:
      break;
    }
  }
}
#endif /* USBPD_DPM_PRS */

/**
  * @brief  Callback function called by PE to inform DPM that an Explicit contract is established.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_ExplicitContractDone(uint8_t PortNum)
{
  /* Turn On VBUS LED when an explicit contract is established */
#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_ON, 0);
#endif /* USBPD_LED_SERVER */
  
#ifdef USBPD_CLI
  sprintf(cli_text,  "\r\n*** [%d] selected cap #%d\r\n", PortNum, DPM_Ports[PortNum].DPM_RDOPosition);
  CLI_Async_Notify(cli_text);
#endif
  
}

/**
  * @brief  Used to check the vbus status present or not
  * @param  PortNum   Index of current used port
  * @param  CurrentRole the current role
  * @retval Return 1 if the VBus is present otherwise 0
  */
uint8_t USBPD_DPM_GetVBusStatus(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole)
{
  return STUSB1602_VBUS_Presence_Get(STUSB1602_I2C_Add(PortNum)) == VBUS_above_UVLO_threshold ? 1 : 0;
}

/**
  * @brief  DPM callback to allow PE to retrieve information from DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId Type of data to be read from DPM
  *         This parameter can be one of the following values:
  *           @arg @ref USBPD_CORE_DATATYPE_SRC_PDO Source PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_SNK_PDO Sink PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SRC_PDO Received Source PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SNK_PDO Received Sink PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQ_VOLTAGE Requested voltage value reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQUEST_DO  Request message DO reading requested (from Sink to Source)
  * @param  Ptr Pointer on address where DPM data should be written (u32 pointer)
  * @param  Size Pointer on nb of u32 written by DPM
  * @retval None
  */
static void USBPD_DPM_GetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint32_t *Ptr, uint32_t *Size)
{
  uint32_t index = 0;

  assert_param(Ptr);
  assert_param(Size);
  
  /* Check type of information targeted by request */
  switch (DataId)
  {
    /* Case Port Source PDO Data information :
       Case Port SINK PDO Data information :
         Call PWR_IF PDO reading request.
    */
    case USBPD_CORE_DATATYPE_SRC_PDO :
    case USBPD_CORE_DATATYPE_SNK_PDO :
      USBPD_PWR_IF_GetPortPDOs(PortNum, DataId, Ptr, Size);
      break;

    /* Case Port Received Source PDO Data information (from distant port) */
    case USBPD_CORE_DATATYPE_RCV_SRC_PDO : 
      for(index = 0; index < DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO; index++)
      {
        *(uint32_t*)(Ptr + index) = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index];
      }
      *Size = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
      break;

    /* Case Port Received Sink PDO Data information (from distant port) */
    case USBPD_CORE_DATATYPE_RCV_SNK_PDO :
      for(index = 0; index < DPM_Ports[PortNum].DPM_NumberOfRcvSNKPDO; index++)
      {
        *(uint32_t*)(Ptr + index) = DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index];
      }
      *Size = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
      break;

    /* Case Requested voltage value Data information */
    case USBPD_CORE_DATATYPE_REQ_VOLTAGE :
      *Ptr = DPM_Ports[PortNum].DPM_RequestedVoltage;
      *Size = 1;
      break;

