st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/MB1303_DRP_DUAL_PORT_RTOS/Src/usbpd_dpm.c
    /* Get the requested voltage */
    pdhandle->DPM_RequestedVoltage = mv;
    pdhandle->DPM_SNKRDOPosition = PDOIndex;
    ret = USBPD_PE_RequestNewPowerProfile(PortNum, PDOIndex);
  }
  else
  {
    USBPD_ErrLog("USBPD_DPM_RequestNewPowerProfile: Invalid PDO index\r");
  }
  return ret;
}


/**
  * @brief  Find PDO index that offers the most amount of power.
  * @param  PortNum Port number
  * @param  PtrRequestedPower  Sink requested power profile structure pointer
  * @retval Index of PDO within source capabilities message (-1 indicating not found)
  */
static int32_t DPM_FindVoltageIndex(uint32_t PortNum, USBPD_SNKPowerRequest_TypeDef* PtrRequestedPower)
{
  uint32_t mv = 0, index  = 0, mw = 0, ma = 0, voltage = 0;
  uint32_t nbpdo;
  uint32_t *ptpdoarray;
  
  /* Max voltage is always limited by the board's max request */
  voltage = USBPD_MIN(PtrRequestedPower->OperatingVoltageInmVunits, PtrRequestedPower->MaxOperatingVoltageInmVunits);
  
  /* The requested voltage not supported by this board */
  if(USBPD_IS_VALID_VOLTAGE(voltage, PtrRequestedPower->MaxOperatingVoltageInmVunits, PtrRequestedPower->MinOperatingVoltageInmVunits) != 1)
  {
    USBPD_ErrLog("DPM_FindVoltageIndex: Requested voltage not supported by the board\r");
    return (-1);
  }

  /* Search PDO index among Source PDO of Port */
  nbpdo = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
  ptpdoarray = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO;
  
  for(index = 0; index < nbpdo; index++)
  {
    mv = ((ptpdoarray[index] >> 10) & 0x3FF) * 50;
    
    /* Skip any voltage not supported by this board */
    if(USBPD_IS_VALID_VOLTAGE(mv, PtrRequestedPower->MaxOperatingVoltageInmVunits, PtrRequestedPower->MinOperatingVoltageInmVunits) != 1)
    {
      USBPD_ErrLog("DPM_FindVoltageIndex: Skip any voltage not supported by this board\r");
    }
    else
    {
      if((ptpdoarray[index] & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
      {
        mw = (ptpdoarray[index] & 0x3FF) * 250000;
      }
      else
      {
        ma = (ptpdoarray[index] & 0x3FF) * 10;
        ma = USBPD_MIN(ma, PtrRequestedPower->MaxOperatingCurrentInmAunits);
        mw = ma * mv;
      }
      mw = USBPD_MIN(mw, (PtrRequestedPower->MaxOperatingPowerInmWunits * 1000));
      
      if((voltage <= mv) && (mw <= (PtrRequestedPower->MaxOperatingPowerInmWunits * 1000)))
      {
        return index;
      }     
    }
  }
  
  return (-1);
}


/**
  * @brief  Set required power by a sink port and store it in DPM Handle
  * @param  PortNum     Index of Current used port
  * @param  Current     Sink board operating Current in mA units
  * @param  Voltage     Sink board operating Voltage in mV units
  * @param  MaxVoltage  Sink board Max supported Voltage in mV units
  * @param  MinVoltage  Sink board Min supported Voltage in mV units
  * @retval USBPD status
  */
USBPD_StatusTypeDef DPM_SetSNKRequiredPower(uint8_t PortNum, uint32_t Current, uint32_t Voltage, uint32_t MaxVoltage, uint32_t MinVoltage)
{
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];
  
  /* Add requested power by sink board to USB PD Handle */
  pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits = Current;
  pdhandle->DPM_SNKRequestedPower.OperatingVoltageInmVunits    = Voltage;
  pdhandle->DPM_SNKRequestedPower.MaxOperatingVoltageInmVunits = MaxVoltage;
  pdhandle->DPM_SNKRequestedPower.MinOperatingVoltageInmVunits = MinVoltage;
  pdhandle->DPM_SNKRequestedPower.OperatingPowerInmWunits      = (Current * Voltage) / 1000;
  pdhandle->DPM_SNKRequestedPower.MaxOperatingPowerInmWunits   = (Current * MaxVoltage) / 1000;
  
  return USBPD_OK;
}
#ifdef USBPD_CLI
/**
  * @brief  
  * @param  PortNum Index of current used port
  * @param  
  * @retval None.
  */
USBPD_StatusTypeDef DPM_CLI_GetStatusInfo(uint8_t PortNum, uint8_t *pProfile, float *pVoltage, uint32_t *pCurrentPDO)
{
  USBPD_StatusTypeDef ret = USBPD_ERROR;
  USBPD_PortPowerRole_TypeDef role = USBPD_PORTPOWERROLE_UNKNOWN;
  if (DPM_Ports[PortNum].DPM_IsConnected)
  {
    role = PE_GetPowerRole(PortNum);
    if (role == USBPD_PORTPOWERROLE_SNK)
    {
      if (pProfile)
      {
        *pProfile = DPM_Ports[PortNum].DPM_SNKRDOPosition;
        ret = USBPD_OK;
      }
      if (pVoltage)
      {
        *pVoltage = ((float)DPM_Ports[PortNum].DPM_RequestedVoltage) / 1000.0;
        ret = USBPD_OK;
      }
      if (pCurrentPDO)
      {
        *pCurrentPDO = DPM_Ports[PortNum].DPM_RequestDOMsg;
        ret = USBPD_OK;
      }
    }
    if (role == USBPD_PORTPOWERROLE_SRC)
    {
      if (pProfile)
      {
        *pProfile = DPM_Ports[PortNum].DPM_RDOPosition;
        ret = USBPD_OK;
      }
      if (pVoltage)
      {
        *pVoltage = ((float)DPM_Ports[PortNum].DPM_RequestedVoltage) / 1000.0;
        ret = USBPD_OK;
      }
      if (pCurrentPDO)
      {
        *pCurrentPDO = DPM_Ports[PortNum].DPM_RcvRequestDOMsg;
        ret = USBPD_OK;
      }
    }
  }
  return ret;
}
#endif /* USBPD_CLI */

/**
  * @brief  EXTI line detection callback.
  * @param  GPIO_Pin Specifies the port pin connected to corresponding EXTI line.
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if(GPIO_Pin == USER_BUTTON_PIN)
  {
    USBPD_DPM_RequestPowerRoleSwap(USBPD_PORT_0);
  }
  else
  {
    USBPD_HW_IF_EXTI_Callback(GPIO_Pin);
  }
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
